---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SplineFailures.CannotCreateSpline
source: html/ffd4fb7b-2c5f-aaf3-4344-898ab488a237.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SplineFailures.CannotCreateSpline Property

Can't make Spline.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateSpline { get; }
```